src/Catalogs/Контакты/Контакты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контакты</name>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Контакты/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Форма элемента справочника Контакты (Wallet HTML).
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Контакт";
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомандаПриложения = ИзвлечьКомандуИзСсылки(ДанныеСобытия.Href);
	
	Если Не ЗначениеЗаполнено(КомандаПриложения) Или КомандаПриложения = "noop" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если КомандаПриложения = "back" Тогда
		
		Закрыть();
		
	ИначеЕсли КомандаПриложения = "name" Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаИмени", ЭтотОбъект);
		ОбщийМодульКлиент.ПоказатьВводТекста(ОписаниеОповещения, Объект.Наименование, "Имя", 100);
		
	ИначеЕсли КомандаПриложения = "phone" Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаТелефона", ЭтотОбъект);
		ОбщийМодульКлиент.ПоказатьВводТелефона(ОписаниеОповещения, Объект.Телефон, "Телефон");
		
	ИначеЕсли КомандаПриложения = "email" Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаПочты", ЭтотОбъект);
		ОбщийМодульКлиент.ПоказатьВводТекста(ОписаниеОповещения, Объект.Почта, "Почта", 100);
		
	ИначеЕсли КомандаПриложения = "comment" Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаКомментария", ЭтотОбъект);
		ОбщийМодульКлиент.ПоказатьВводТекста(ОписаниеОповещения, Объект.Комментарий, "Комментарий", 200);
		
	ИначеЕсли КомандаПриложения = "save" Тогда
		
		ПодключитьОбработчикОжидания("ЗаписатьОтложенно", 0.05, Истина);
		
	ИначеЕсли КомандаПриложения = "delete" Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодтвержденияУдаления", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Удалить контакт?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВводаИмени(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Наименование = Результат;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаТелефона(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Телефон = Результат;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПочты(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Почта = Результат;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКомментария(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Комментарий = Результат;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияУдаления(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если УдалитьНаСервере() Тогда
		
		Оповестить("КонтактыИзменены");
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОтложенно() Экспорт
	
	ТекстОшибки = ЗаписатьНаСервере();
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
		
	КонецЕсли;
	
	Оповестить("КонтактыИзменены");
	
	Если Открыта() Тогда
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		
		Возврат "Укажите имя контакта";
		
	КонецЕсли;
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	СправочникОбъект.Записать();
	ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция УдалитьНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Объект.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОбновитьHTMLНаСервере()
	
	Данные = Новый Структура("Наименование, Телефон, Почта, Комментарий",
		Объект.Наименование, Объект.Телефон, Объект.Почта, Объект.Комментарий);
	ТекстHTML = ОбщийМодульСервер_СправочникиUI.HTMLЭлементаКонтакта(Данные);
	
КонецПроцедуры

&НаКлиенте
Функция ИзвлечьКомандуИзСсылки(АдресСсылки)
	
	Если Не ЗначениеЗаполнено(АдресСсылки) Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Позиция = СтрНайти(НРег(АдресСсылки), "app:");
	
	Если Позиция = 0 Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат Сред(АдресСсылки, Позиция + 4);
	
КонецФункции

#КонецОбласти
